/**
 * Created by User on 5/19/2018.
 */
public class Main {

    public static void main(String[]  args) {
        int q = 1, w = 2;

        symma2(1, 2);
    }

    public static int symma2(int a, int b) {
        int c = a + b;
        return c;
    }

    public static double perimeter(double a, double b) {
        return 2 * (a + b);
    }

    public static double f(double x) {
        double y = x*x - 1;
        return y;
    }
    // однострочный комментарий

    /*
    многострочный комментарий

    1. Написать функцию расчета площади прямоугольник
    2. Написать функцию расчета х^3 + x^2 + 1
    3. Написать функцию расчета sin двойного угла

    4. Вызвать функцию в мейне из первого задания для значений 1 и 2 и вывести результат
    5. Вызвать функцию в мейне из первого задания для значений 7 и 8 и вывести результат, 9 и 10 и вывести результат.
    6. Вызвать функцию в мейне из второго задания для значений 5, -2, 19 и вывести результаты.
    7. Вывзвать фунцию в мейне из третьего задания для угла 45 градусов и вывести результат.

    8. Написать функцию расчета третьей стороны треугольника по двум другим и углу между ними
    double triC(double a, double b, double angle)...
    9. Значения: 3, 4, 90 = 5
                 12, 5, 90 = 13
                 15, 16, 180 = 31


     */

}
